Tekla.Structures.Model.PourBreakExtensions
The Tekla.Structures.Model.PourBreakExtensions class provides a set of methods to query instances of the Tekla.Structures.Model.PourBreak type.

Tekla.Structures.Model.PourBreakExtensions.TryGetClosestEdgeTo(Tekla.Structures.Model.PourBreak,Tekla.Common.Geometry.Vector3,Tekla.Common.Geometry.Segment3@)
Gets the closest edge of the pourBreak to the specified Tekla.Common.Geometry.Vector3 value.
pourBreak: The Tekla.Structures.Model.PourBreak to get the closest edge from.
point: The Tekla.Common.Geometry.Vector3 to get the closest edge to.
closestEdge: The closest solid edge as a Tekla.Common.Geometry.Segment3 value.
Returns: True if pourBreak defines resolvable segments; otherwise, false.